{
  "education": [
    {
      "awards_achievements": [
        "Entry Scholarship",
        "Participant of RU Hacks 2019"
      ],
      "degree": "Bachelor of Science (Honours), Computer Science",
      "department": "Science",
      "duration": "2017-2022",
      "school_name": "Ryerson University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_HyebinYoon",
  "highlighted_projects": [
    {
      "description": "Worked in a team of three to develop an E-commerce website to sell appliances to customers. Utilizing HTML, CSS, JavaScript, PHP, Apache, phpMyAdmin, and Google Map API. Implemented Drag / Drop on Shopping Cart icon functionality using JavaScript. Used Bootstrap framework. Responsive to different screen sizes (Phone, Tablet and pc).",
      "git_url": "https://github.com/binyoon99/CPS630Pro",
      "name": "Appliance Buy Website"
    },
    {
      "description": "2D Platform game where users can control the character to reach the finish line, avoiding/killing monsters, collecting coins and avoid from falling off the platform. Available in Windows and Mac operating systems.Used Unity Engine to develop the game in a 2-Dimension space.Implemented Rigidbody, SpriteRenderer, Animator, AudioClip and Collider in C#. Gathered user feedback and integrated it into product development and maintenance. Applied basic physic and game theory. ",
      "git_url": "https://github.com/binyoon99/Binrio-Platform-Game",
      "name": "Unity 2D Pixel Games"
    },
    {
      "description": "Collaborated with a team of two to develop a lyric bot that predicts a name of the song from inputted lyric by the users. Bot uses Python API to provide information to the users, including the lyrics, album, and artist of the predicted song. Used a Python package, beautiful soup, to parse and extract data from HTML lyric websites and compare the data to given information by the users. Responsive to users' chat with various commands. Utilized GitHub to collab.",
      "git_url": "https://github.com/binyoon99/bintonBot",
      "name": "Discord Lyric Bot"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The Linux Cluster Monitoring Agent (LCMA) is a cluster monitoring software tool created for the Linux Cluster Administration (LCA) team. The tool's purpose is to manage and record hardware specifications and resource usage of their Linux clusters.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_HyebinYoon/tree/main/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: The Java Database Connectivity (JDBC) application was developed to create a connection between a Java application and to PostgreSQL RDBMS using Java library, Data Access Object (DAO), Data Transfer Object (DTO) and Repository design pattern.",
        "Grep App: The Grep Application imitates Linux grep command. From a given root directory, the grep app search through all the files in the folder and the sub-folders to find text patterns and output matched lines to a specific file."
      ],
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_HyebinYoon/tree/develop/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Hyebin (Heather) Yoon",
  "others": [
    {
      "bullets": [
        "1st place Champion in Ontario, Canada",
        "https://gao.bluegolf.com/bluegolfw/gao15/event/gao1526/index.htm"
      ],
      "title": "2015 ONTARIO JUVENILE (U17) Golf GIRLS' CHAMPION"
    },
    {
      "bullets": [
        " Created digital contents related to personal hobbies and interests",
        " Collaborated with multiple brands to promote their products to the fans"
      ],
      "title": "Content Creator"
    },
    {
      "bullets": [
        "Junior Amateur Golf player (2008~2016)",
        "Casual Gamer",
        "Coffee Lover"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked in a team of software developers in an Agile/Scrum work environment. Performed daily scrum meetings, and take the initiative and set an example as team leader for two-week sprint period. Developed various applications in an Agile team, communicating with other developers about the design, concept, impediments, and brainstorming ideas.  Worked with technologies such as vision of each projects.  Github, Docker, Maven, PostgresSQL, APIs, Postman.",
      "duration": "Sept 2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Ted Rogers School of Management ",
      "description": "Provided front-line technical support for faculty, staff, and student. Troubleshooting hardware, and software issues, liaising with internal and external support resources. Solved tickets through Zendesk and worked as a team to prioritize tasks to deal with multiple conflicting dealines.  ",
      "duration": "Jan 2022 - May 2022",
      "title": "Information Technology Support Helpdesk"
    },
    {
      "company": "Café Inside",
      "description": "Respond to customers complaints, questions, and feedback in professional matter. Priortize tasks, and schedule of employees. Utilize Microsoft Office products (Excel, PowerPoint and Outlook) to track daily sales, business documents and provide analysis for future sales. Maintain positive attitude while working in a fast pace environment to bring the best efficiency to the business.",
      "duration": "May 2018 - Dec 2021",
      "title": "Assistant Store Manager"
    }
  ],
  "skills": {
    "competent": [
      "React",
      "Node.js / Express.js",
      "Data Structures",
      "SpringBoot",
      "Docker",
      "Firebase"
    ],
    "familiar": [
      "Postman",
      "Docker",
      "MongoDB",
      "C#",
      "Unity"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "JavaScript",
      "HTML/CSS"
    ]
  },
  "summary": "I recently graduated from Ryerson University with a Bachelor of Science (Honours) in  Computer Science, and I intend to venture into Software development and Cloud engineering. I have studied software engineering, software project management, algorithm, web development, discrete mathematics, data structure, data mining, database system, data science, computer network and security, and artificial intelligence. From an early age, I grew up looking up to my father, a Software Engineer, and always interested in becoming a developer and further extending my knowledge to become a cloud engineer. My passion extended to my free time, which led me to develop various applications to assist me in my hobby during my five years of study and acquired practical experience with Java, JavaScript, SQL, and HTML/CSS. Currently, I'm working as a Software Developer at Jarvis Consulting Group and proudly say I'm making the most of the experience working as my dream job. Altogether, I'm more than excited to use my knowledge and abilities to seek new opportunities and bring the best out of me for the new journey."
}
